OdDAI.ADB_Value.clean
\details
Clear all data.

OdDAI.ADB_Value.type
\details
Provides tyep of the value.
\returns the type OdTCKind.

OdDAI.ADB_Value.getValue(OdDAI.Aggr**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets OdDAI::Aggr* value.
\param getTo [out] the reference to OdDAI::Aggr* value to get to.
\returns if the internal type is OdDAI::Aggr* the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets OdAnsiString value.
\param getTo [out] the reference to OdAnsiString value to get to.
\returns if the internal type is OdAnsiString the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets const char* value.
\param getTo [out] the reference to const char* value to get to.
\returns if the internal type is const char* the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(OdDAIObjectId*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets OdDAIObjectId value.
\param getTo [out] the reference to OdDAIObjectId value to get to.
\returns if the internal type is OdDAIObjectId the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(OdDAI.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets Boolean value.
\param getTo [out] the reference to Boolean value to get to.
\returns if the internal type is Boolean the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(OdDAI.Logical*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets Logical value.
\param getTo [out] the reference to Logical value to get to.
\returns if the internal type is Logical the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets double value.
\param getTo [out] the reference to double value to get to.
\returns if the internal type is double the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(OdDAI.EnumValueInfo*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets EnumValueInfo value.
\param getTo [out] the reference to EnumValueInfo value to get to.
\returns if the internal type is EnumValueInfo the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(System.Boolean*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets bool value.
\param getTo [out] the reference to bool value to get to.
\returns if the internal type is bool the function returns true, in otherwis returns false.

OdDAI.ADB_Value.getValue(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets int value.
\param getTo [out] the reference to int value to get to.
\returns if the internal type is int the function returns true, in otherwis returns false.

OdDAI.ADB_Value.setValue(OdDAI.Aggr*)
\details
Sets Aggr* value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets OdAnsiString value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Sets const char* value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets OdDAIObjectId value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(OdDAI.Boolean!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets Boolean value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets Logical value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(System.Double!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets double value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(OdDAI.EnumValueInfo!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets EnumValueInfo value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(System.Boolean!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets bool value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(System.Int32!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets int value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.op_Equality(OdDAI.ADB_Value!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compare two values.
\param rightValue [in] other value to compare.
\returns true if equal, and false otherwise.

OdDAI.ADB_Value.op_Assign(OdDAI.ADB_Value!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy one value to another.
\param rightValue [in] value to copy from.
\returns the reference to itself.

OdDAI.ADB_Value.Dispose
\details
Destroys th value.

OdDAI.ADB_Value.#ctor(OdDAI.ADB_Value!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor copy. Creates a new empty instance and init data from the right value.
\param rightValue [in] the value to copy from.

OdDAI.ADB_Value.#ctor
\details
Creates a new empty instance.

OdDAI.ADB_Value
\details
Class should holds a value of select.